/*************************************
 Vido 1: void main & print
*************************************/
//void main(){
// print("my journey in dart");
/*************************************
Vido 2: Variables
**************************************/
//String  هاد المتغير للنصوص
// String Ex ="khalil Ayman Souliman";
// print(Ex);
// //var  متغير ديناميكي بيقبل كلشي
// var ex1=3;
// print(ex1);
// var ex2="khalil";
// print(ex2);
// var ex3=true;
// print(ex3);
// //int متغير للارقام الصحيحة
// int x=454;
// print(x);
// //double هاد المتغير للارقام العشرية 
// double y=4.44;
// print(y);
// //num هاد المتغير بيقبل كل الارقام عشرية وصحيحة
// num ex4=23;
// print(ex4);
// num ex5=23.33;
// print(ex5);
// //bool هاد المتغير بيقبل قيمتين فقط true or false
// bool b=false;
// print(b);
// bool v=true;
// print(v);
// // في متغيرات قابلة للتغير ومتغيرات غير قابلة للتعديل 
// //Ex: 
// int zx=34;
// zx=5;
// print(zx);// هاد قابل للتعديل

// const int xr=2;
// //x=5;
// print(xr);// هاد غير قابل للتعديل 
/***********************************************
Vido 3: Type conversion
 ***********************************************/
// String name="23";
// int e=int.parse(name);// from string to int
// print(e);
// print(e.runtimeType);// لمعرفة نوع المتغير 
// //----------------------------------------
// String t="33";
// double u=double.parse(t);// from string to double
// print(u);
// //----------------------------------------
// double k=99.9;
// int y=k.toInt();// from double to int
// print(y);
// //----------------------------------------
// int x=40;
// double n=x.toDouble();// from int to double
// print(n);
// //----------------------------------------
// double c=66.8;
// String b=c.toString();// from double to string
// print(b);
// print(b.runtimeType);//للتأكد من ان المتغير اصبح من نوع سترينغ
// //-----------------------------------------
// int vv=33;
// String bb=vv.toString();// from int to string
// print(bb);
/***********************************************
 Vido 4:   C o m m e n t
************************************************/
// // نستخدم التعليقات لترك رسالة لتذكرنا بوظيفة الكود 
// // ونستخدمه من اجل شرح الكود للمبرمجين الاخرين
// // ويوجد ثلاثة انواع للكمونت 
// // النوع الاول: اذا كنا نريد كتابة سطر واحد فقط نستخدم دبل سلاش
// // example: مثل جميع الاسطر المكتوبة بالاعلى
// // النوع الثاني: اذا كنا نريد كتابة اكثر من سطر نستخدم (/* النص هنا*/)
// //example: 
// /*هيك عم اكتب اكتر من سطر 
// بكمونت واحد بس وباكثر من سطر*/
// //النوع الثالث: Doc Comment: لنستخدمه منكتب تربل سلاش 
// // وظيفته شرح وظيفة الدالة
// //example: 
// printName();// استدعاء الدالة ليتم تشغيلها 
// }
// ///  هاد اسمك يا خليل
// void printName()
// {
// print("khalil ayman souliman");
// }
/*************************************
Vido 5: Arithmetic Operators
**************************************/ 
void main(){
//     //عمليةالجمع(+)
//     int c=30;
//     int b=4;
//     int n= c+b;
//     print(n);
//     //-------------------------
//     // عملية الطرح (-)
//     int e=c-b;
//     print(e);
//     //-------------------------
//     //عملية الضرب (*)
//     int a=c*b;
//     print(a);
//     //--------------------------
//     //عملية القسمة (/):دائما نستخدم متغير دبل
//     double k= c/b;
//     print(k);
//     // او فينا نستخدم انتجر بس لازم نستخدم(~)
//    //example:
//    int m= c ~/ b;
//    print(m);// بس الناتج هون بيعطينا الجواب بدون الفاصلة
//    //------------------------------------------
//    //عملية باقي القسمة(%)
//    int aa= c % b;
//    print(aa);
/***********************************************************
 Vido 6:
 **********************************************************/


}







